[
  {
    "slug": "teach-english-cambodia-no-degree",
    "title": "How to Teach English in Cambodia Without a Degree (2025 Guide) | GlobeScraper",
    "description": "No degree? No problem. Learn how to get TEFL certified, find teaching jobs in Cambodia, and start a new life in 2025.",
    "date": "2025-01-15"
  },
  {
    "slug": "south-africans-moving-to-cambodia-2025",
    "title": "South Africans in Cambodia: 2025 Guide to Moving, Teaching, and Living Well | GlobeScraper",
    "description": "A complete guide for South Africans moving to Cambodia. TEFL, visas, jobs, housing, costs, and life on the ground in 2025.",
    "date": "2025-02-05"
  },
  {
    "slug": "teaching-job-in-cambodia-2025",
    "title": "How to Find a Teaching Job in Cambodia in 2025: Step by Step Guide | GlobeScraper",
    "description": "Step-by-step guide to landing a teaching job in Cambodia. TEFL tips, job search methods, salary expectations, visas, and budgets.",
    "date": "2025-02-12"
  },
  {
    "slug": "cost-of-living-cambodia-teachers",
    "title": "Cost of Living in Cambodia for English Teachers (2025 Guide) | GlobeScraper",
    "description": "Real cost of living breakdown for English teachers in Cambodia. Rent, food, transport, and how far your salary goes in 2025.",
    "date": "2025-01-28"
  },
  {
    "slug": "cambodia-vs-usa-uk-south-africa-disposable-income-2025",
    "title": "Cambodia vs USA, UK, and South Africa in 2025: Who Has the Most Disposable Income? | GlobeScraper",
    "description": "Compare real disposable income across Cambodia, the USA, the UK, and South Africa. See where your money actually goes furthest in 2025.",
    "date": "2025-02-20"
  },
  {
    "slug": "what-to-pack-for-teaching-english-in-cambodia-2025",
    "title": "What to Pack for Teaching English in Cambodia: 2025 Guide for New Teachers | GlobeScraper",
    "description": "Essential packing list for teaching English in Cambodia. Avoid common mistakes, save money, and arrive prepared in 2025.",
    "date": "2025-02-18"
  }
]